performance/results/artilleryRaceRegistration_result_Test20_2022-11-08-23-43-1667947419.txt
Phase started: Warm up (index: 0, duration: 30s) 23:43:42(+0100)

--------------------------------------
Metrics for period to: 23:43:50(+0100) (width: 6.076s)
--------------------------------------

http.codes.201: ................................................................ 7
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 7
http.response_time:
  min: ......................................................................... 35
  max: ......................................................................... 1291
  median: ...................................................................... 64.7
  p95: ......................................................................... 320.6
  p99: ......................................................................... 320.6
http.responses: ................................................................ 7
vusers.completed: .............................................................. 7
vusers.created: ................................................................ 7
vusers.created_by_name.Register in Race by Order: .............................. 7
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 37.9
  max: ......................................................................... 1401.2
  median: ...................................................................... 82.3
  p95: ......................................................................... 320.6
  p99: ......................................................................... 320.6


Phase completed: Warm up (index: 0, duration: 30s) 23:44:12(+0100)

Phase started: Massive load (index: 1, duration: 30s) 23:44:12(+0100)

--------------------------------------
Metrics for period to: 23:44:00(+0100) (width: 9.03s)
--------------------------------------

http.codes.201: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 124
  median: ...................................................................... 53
  p95: ......................................................................... 83.9
  p99: ......................................................................... 83.9
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Register in Race by Order: .............................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 24.2
  max: ......................................................................... 133.7
  median: ...................................................................... 63.4
  p95: ......................................................................... 96.6
  p99: ......................................................................... 96.6


--------------------------------------
Metrics for period to: 23:44:10(+0100) (width: 9.065s)
--------------------------------------

http.codes.201: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 21
  max: ......................................................................... 72
  median: ...................................................................... 29.1
  p95: ......................................................................... 59.7
  p99: ......................................................................... 59.7
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Register in Race by Order: .............................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 22.8
  max: ......................................................................... 79.1
  median: ...................................................................... 32.1
  p95: ......................................................................... 68.7
  p99: ......................................................................... 68.7


--------------------------------------
Metrics for period to: 23:44:20(+0100) (width: 9.439s)
--------------------------------------

http.codes.201: ................................................................ 5
http.request_rate: ............................................................. 397/sec
http.requests: ................................................................. 3128
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 6363
  median: ...................................................................... 314.2
  p95: ......................................................................... 1790.4
  p99: ......................................................................... 1790.4
http.responses: ................................................................ 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 3130
vusers.created_by_name.Register in Race by Order: .............................. 3130
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 29.4
  max: ......................................................................... 6364.6
  median: ...................................................................... 320.6
  p95: ......................................................................... 1790.4
  p99: ......................................................................... 1790.4


--------------------------------------
Metrics for period to: 23:44:30(+0100) (width: 9.999s)
--------------------------------------

http.codes.201: ................................................................ 48
http.codes.400: ................................................................ 35
http.codes.500: ................................................................ 1
http.request_rate: ............................................................. 464/sec
http.requests: ................................................................. 4620
http.response_time:
  min: ......................................................................... 7127
  max: ......................................................................... 16471
  median: ...................................................................... 11274.1
  p95: ......................................................................... 16486.1
  p99: ......................................................................... 16486.1
http.responses: ................................................................ 84
vusers.completed: .............................................................. 84
vusers.created: ................................................................ 4620
vusers.created_by_name.Register in Race by Order: .............................. 4620
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7142.6
  max: ......................................................................... 16486
  median: ...................................................................... 11274.1
  p95: ......................................................................... 16486.1
  p99: ......................................................................... 16486.1


--------------------------------------
Metrics for period to: 23:44:40(+0100) (width: 9.993s)
--------------------------------------

http.codes.201: ................................................................ 77
http.codes.400: ................................................................ 77
http.codes.500: ................................................................ 7
http.request_rate: ............................................................. 580/sec
http.requests: ................................................................. 5792
http.response_time:
  min: ......................................................................... 16841
  max: ......................................................................... 25014
  median: ...................................................................... 20958.1
  p95: ......................................................................... 24594.7
  p99: ......................................................................... 24594.7
http.responses: ................................................................ 161
vusers.completed: .............................................................. 161
vusers.created: ................................................................ 5792
vusers.created_by_name.Register in Race by Order: .............................. 5792
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16844.1
  max: ......................................................................... 25024.2
  median: ...................................................................... 20958.1
  p95: ......................................................................... 24594.7
  p99: ......................................................................... 24594.7


Phase completed: Massive load (index: 1, duration: 30s) 23:44:46(+0100)

--------------------------------------
Metrics for period to: 23:44:50(+0100) (width: 9.56s)
--------------------------------------

http.codes.201: ................................................................ 35
http.codes.400: ................................................................ 85
http.codes.500: ................................................................ 4
http.request_rate: ............................................................. 209/sec
http.requests: ................................................................. 1463
http.response_time:
  min: ......................................................................... 29729
  max: ......................................................................... 36651
  median: ...................................................................... 34554.7
  p95: ......................................................................... 35964.9
  p99: ......................................................................... 36691.5
http.responses: ................................................................ 124
vusers.completed: .............................................................. 124
vusers.created: ................................................................ 1461
vusers.created_by_name.Register in Race by Order: .............................. 1461
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 29730.7
  max: ......................................................................... 36653.9
  median: ...................................................................... 34554.7
  p95: ......................................................................... 35964.9
  p99: ......................................................................... 36691.5


--------------------------------------
Metrics for period to: 23:45:00(+0100) (width: 7.127s)
--------------------------------------

http.codes.201: ................................................................ 103
http.codes.400: ................................................................ 125
http.codes.500: ................................................................ 19
http.codes.504: ................................................................ 6
http.response_time:
  min: ......................................................................... 38555
  max: ......................................................................... 46767
  median: ...................................................................... 43058.1
  p95: ......................................................................... 46644.4
  p99: ......................................................................... 46644.4
http.responses: ................................................................ 253
vusers.completed: .............................................................. 253
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 38558.4
  max: ......................................................................... 46769.5
  median: ...................................................................... 43058.1
  p95: ......................................................................... 46644.4
  p99: ......................................................................... 46644.4


--------------------------------------
Metrics for period to: 23:45:10(+0100) (width: 6.538s)
--------------------------------------

http.codes.201: ................................................................ 20
http.codes.400: ................................................................ 36
http.codes.500: ................................................................ 12
http.codes.504: ................................................................ 1007
http.response_time:
  min: ......................................................................... 48351
  max: ......................................................................... 56738
  median: ...................................................................... 51550.2
  p95: ......................................................................... 53654.1
  p99: ......................................................................... 53654.1
http.responses: ................................................................ 1075
vusers.completed: .............................................................. 1075
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 48414.6
  max: ......................................................................... 56739.7
  median: ...................................................................... 51550.2
  p95: ......................................................................... 53654.1
  p99: ......................................................................... 53654.1


--------------------------------------
Metrics for period to: 23:45:20(+0100) (width: 5.305s)
--------------------------------------

http.codes.201: ................................................................ 9
http.codes.400: ................................................................ 43
http.codes.500: ................................................................ 3
http.codes.504: ................................................................ 1598
http.response_time:
  min: ......................................................................... 48737
  max: ......................................................................... 59156
  median: ...................................................................... 54738
  p95: ......................................................................... 58122.9
  p99: ......................................................................... 59297.1
http.responses: ................................................................ 1653
vusers.completed: .............................................................. 1653
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 48763.3
  max: ......................................................................... 59165.7
  median: ...................................................................... 54738
  p95: ......................................................................... 58122.9
  p99: ......................................................................... 59297.1


--------------------------------------
Metrics for period to: 23:45:30(+0100) (width: 9.692s)
--------------------------------------

http.codes.504: ................................................................ 2459
http.response_time:
  min: ......................................................................... 52813
  max: ......................................................................... 66719
  median: ...................................................................... 61717.2
  p95: ......................................................................... 65533.7
  p99: ......................................................................... 66857.6
http.responses: ................................................................ 2459
vusers.completed: .............................................................. 2459
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 52814.6
  max: ......................................................................... 66721.5
  median: ...................................................................... 61717.2
  p95: ......................................................................... 65533.7
  p99: ......................................................................... 66857.6


--------------------------------------
Metrics for period to: 23:45:40(+0100) (width: 9.997s)
--------------------------------------

http.codes.503: ................................................................ 1102
http.codes.504: ................................................................ 2932
http.response_time:
  min: ......................................................................... 48165
  max: ......................................................................... 72899
  median: ...................................................................... 62964
  p95: ......................................................................... 70992
  p99: ......................................................................... 72426.2
http.responses: ................................................................ 4034
vusers.completed: .............................................................. 4033
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 48184.6
  max: ......................................................................... 72901.1
  median: ...................................................................... 62964
  p95: ......................................................................... 70992
  p99: ......................................................................... 72426.2


--------------------------------------
Metrics for period to: 23:45:50(+0100) (width: 9.985s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 68
http.codes.503: ................................................................ 1803
http.codes.504: ................................................................ 1145
http.response_time:
  min: ......................................................................... 53074
  max: ......................................................................... 76324
  median: ...................................................................... 65533.7
  p95: ......................................................................... 70992
  p99: ......................................................................... 72426.2
http.responses: ................................................................ 2948
vusers.completed: .............................................................. 2949
vusers.failed: ................................................................. 68
vusers.session_length:
  min: ......................................................................... 53081.3
  max: ......................................................................... 76325.5
  median: ...................................................................... 65533.7
  p95: ......................................................................... 70992
  p99: ......................................................................... 72426.2


--------------------------------------
Metrics for period to: 23:46:00(+0100) (width: 9.991s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 1501
http.codes.503: ................................................................ 8
http.codes.504: ................................................................ 349
http.response_time:
  min: ......................................................................... 66350
  max: ......................................................................... 79978
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 357
vusers.completed: .............................................................. 357
vusers.failed: ................................................................. 1501
vusers.session_length:
  min: ......................................................................... 66376.5
  max: ......................................................................... 79990.7
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:46:10(+0100) (width: 7.087s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 251
http.codes.504: ................................................................ 30
http.response_time:
  min: ......................................................................... 74858
  max: ......................................................................... 79843
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 30
vusers.completed: .............................................................. 30
vusers.failed: ................................................................. 251
vusers.session_length:
  min: ......................................................................... 74883.7
  max: ......................................................................... 79850.7
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6


All VUs finished. Total time: 2 minutes, 30 seconds

--------------------------------
Summary report @ 23:46:11(+0100)
--------------------------------

errors.ETIMEDOUT: .............................................................. 1820
http.codes.201: ................................................................ 324
http.codes.400: ................................................................ 401
http.codes.500: ................................................................ 46
http.codes.503: ................................................................ 2913
http.codes.504: ................................................................ 9526
http.request_rate: ............................................................. 130/sec
http.requests: ................................................................. 15030
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 79978
  median: ...................................................................... 61717.2
  p95: ......................................................................... 70992
  p99: ......................................................................... 78458.5
http.responses: ................................................................ 13210
vusers.completed: .............................................................. 13210
vusers.created: ................................................................ 15030
vusers.created_by_name.Register in Race by Order: .............................. 15030
vusers.failed: ................................................................. 1820
vusers.session_length:
  min: ......................................................................... 22.8
  max: ......................................................................... 79990.7
  median: ...................................................................... 61717.2
  p95: ......................................................................... 70992
  p99: ......................................................................... 78458.5